-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 14 2023 г., 18:30
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `active` int NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `active`, `created_at`) VALUES
(1, 'Детская посуда', 1, '2022-12-11 14:02:35'),
(2, 'Пластиковая посуда', 1, '2022-12-11 14:02:35'),
(3, 'Посуда для напитков', 1, '2022-12-11 14:04:28'),
(4, 'Посуда для чая и кофе', 1, '2022-12-11 14:04:28'),
(5, 'Прочие предметы сервировки', 1, '2022-12-11 14:05:15'),
(6, 'Сервизы', 1, '2022-12-11 14:05:15'),
(7, 'Столовые приборы', 1, '2022-12-11 14:05:48'),
(8, 'Тарелки', 1, '2022-12-11 14:05:48'),
(9, 'Чашки и кружки', 1, '2022-12-11 14:06:22');

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` float NOT NULL DEFAULT '0',
  `descr` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `cat_id` int NOT NULL DEFAULT '0',
  `active` int NOT NULL DEFAULT '1',
  `created_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`id`, `name`, `price`, `descr`, `cat_id`, `active`, `created_at`) VALUES
(1, 'Блюдо TRAMONTINA 64510/610-TR, прямоугольное с крышкой для холодных закусок', 2390, 'test1', 8, 1, '2022-12-11 14:06:56'),
(2, 'Тарелка суповая LUMINARC J0765, 20 см, стекло', 399, '[newtest]', 8, 1, '2022-12-11 14:06:56'),
(3, 'Тарелка суповая LUMINARC Q7486, 21 см, стекло', 289, 'test3', 8, 1, '2022-12-11 14:45:41'),
(4, 'Тарелка суповая FIORETTA Springtime TDP632, 21,5 см, фарфор', 649, 'test4', 8, 1, NULL),
(5, 'Тарелка суповая DOMENIK Peonia DM9711, 21 см, фарфор', 449, 'test5', 8, 1, NULL),
(6, 'Тарелка суповая DOMENIK Laguna DM6002, 21 см, керамика', 349, 'test6', 8, 1, NULL),
(7, 'Тарелка суповая FIORETTA TDP082, 23 см, фарфор', 479, 'test7', 8, 1, '2022-12-15 12:52:31'),
(8, 'Тарелка суповая FIORETTA TDP605, 21,5 см, фарфор', 519, 'test8', 8, 1, '2022-12-15 12:52:31'),
(9, 'Тарелка суповая DOMENIK DM9741, 23 см, фарфор', 649, 'test9', 8, 1, '2022-12-15 12:53:46'),
(10, 'Тарелка суповая LUMINARC Q6878, 20 см, стекло', 199, 'хорошая тарелка', 8, 1, '2022-12-15 12:53:46'),
(11, 'Тарелка суповая LUMINARC Q1309, 18 см, стекло', 205, 'плохая тарелка', 8, 1, '2022-12-15 12:54:44'),
(12, 'Тарелка суповая LUMINARC Q6013, 20 см, стекло', 339, 'плохая тарелка', 8, 1, '2022-12-15 12:54:44'),
(13, 'Набор детских столовых приборов Fontignac, 3 предмета\r\n', 549, 'test13', 1, 1, '2022-12-17 23:49:29'),
(14, 'Набор столовых приборов Аtmosphere Funny ocean детский, сталь, 4 предмета', 779, 'test14', 1, 1, '2022-12-17 23:49:29'),
(15, 'Набор Sugar&Spice кувшин 1,9 л + 3 стакана, фисташковый', 369, 'test15', 2, 1, '2022-12-17 23:51:48'),
(16, 'Набор для пикника Sugar&Spice, 9 предметов, латте', 499, 'test16', 2, 1, NULL),
(17, 'Миска с крышкой Plast Team Нelsinki, персиковая карамель, 0,5 л', 99, 'test17', 2, 1, '2022-12-17 23:53:36'),
(18, 'Набор Sugar&Spice кувшин 1,9 л + 3 стакана, латте', 369, 'test18', 2, 1, NULL),
(19, 'Миска Polimerbyt Альтер с крышкой 6 л', 318, 'test19', 2, 1, '2022-12-17 23:54:44'),
(20, 'Миска с крышкой Plast Team Нelsinki, персиковая карамель, 5 л', 393, 'test20', 2, 1, '2022-12-17 23:54:44'),
(21, 'Миска с крышкой Plast Team Нelsinki, голубой океан, 5 л', 393, 'test21', 2, 1, '2022-12-17 23:56:15'),
(22, 'Миска с крышкой Plast Team Нelsinki, персиковая карамель, 3 л', 245, 'test22', 2, 1, '2022-12-17 23:56:15'),
(23, 'Миска с крышкой Plast Team Нelsinki, голубой океан, 3 л', 245, 'test23', 2, 1, '2022-12-17 23:57:16'),
(24, 'Миска с крышкой Plast Team Нelsinki, персиковая карамель, 2 л', 182, 'test24', 2, 1, '2022-12-17 23:57:16'),
(25, 'Миска с крышкой Plast Team Нelsinki, голубой океан, 2 л', 182, 'test25', 2, 1, '2022-12-17 23:58:11'),
(26, 'Миска с крышкой Plast Team Нelsinki, персиковая карамель, 1 л', 127, 'test26', 2, 1, '2022-12-17 23:58:11'),
(27, 'Стакан для виски 05с1240, 250 мл', 35, 'test27', 3, 1, '2022-12-18 23:59:54'),
(28, 'Бокал для вина Pasabahce 44412 SL/St, 220 мл', 89, 'test28', 3, 1, '2022-12-18 23:59:54'),
(31, 'Кувшин Аgness Роскошный сад, стекло, 1,4 л', 1160, 'test31', 3, 1, '2022-12-18 00:02:32'),
(32, 'Кувшин Тебриз, стекло, фиолетовый, 1,1 л', 1609, 'test32', 3, 1, '2022-12-18 00:02:32'),
(33, 'Термокувшин Walmer Cordial 1200 мл', 2559, 'test33', 3, 1, '2022-12-18 00:03:40'),
(34, 'Кувшин Walmer Вerry 1400 мл', 1390, 'test34', 3, 1, '2022-12-18 00:03:40'),
(35, 'Кувшин Рentola, стекло/пластик, 2,5 л', 719, 'test35', 3, 1, '2022-12-18 00:04:53'),
(36, 'Кувшин Рentola, стекло/пластик, 1,2 л', 469, 'test36', 3, 1, '2022-12-18 00:04:53'),
(37, 'Термобокал Walmer Cat 280 мл\r\n', 960, 'test37', 3, 1, '2022-12-18 00:05:45'),
(38, 'Термобокал Walmer King 2 шт. х 350 мл', 1749, 'test38', 3, 1, '2022-12-18 00:05:45'),
(39, 'Сахарница Walmer Wave 0,19 л', 199, 'test39', 4, 1, '2022-12-18 00:12:52'),
(40, 'Сахарница Walmer Vivien, фарфор', 850, 'test40', 4, 1, '2022-12-18 00:12:52'),
(41, 'Сахарница, керамика, 400 мл', 460, 'test41', 4, 1, '2022-12-18 00:15:11'),
(42, 'Сахарница Снежная королева, керамика, 500 мл', 809, 'test42', 4, 1, '2022-12-18 00:15:11'),
(43, 'Сахарница Wilmax England, фарфор, 325 мл', 526, 'test43', 4, 1, '2022-12-18 00:16:17'),
(44, 'Сахарница c ложкой Аtmosphere Factura, фарфор/бамбук, 350 мл', 499, 'test44', 4, 1, '2022-12-18 00:16:17'),
(45, 'Сахарница, сталь/стекло, 250 мл', 296, 'test45', 4, 1, '2022-12-18 00:17:04'),
(46, 'Чайник заварочный Катюша, сталь, 2,2 л', 2366, 'test46', 4, 1, '2022-12-18 00:17:04'),
(47, 'Салфетница Снежная королева, керамика, 11 х 4 х 7,5 см', 409, 'test47', 5, 1, '2022-12-18 00:18:41'),
(51, 'Салфетница Аpollo Genio cite silver, сталь', 479, 'test48', 5, 1, '2022-12-18 00:18:41'),
(52, 'Масленка Phibo, голубая, 180 х 95 х 65 мм', 143, 'test49', 5, 1, '2022-12-18 00:19:29'),
(53, 'Зубочистки Рыжий кот, пластик, 300 шт.', 111, 'test50', 5, 1, '2022-12-18 00:19:29'),
(54, 'Сервиз чайный Рококо платина 6/15 фарфор', 9990, 'test51', 6, 1, '2022-12-18 00:20:44'),
(55, 'Сервиз чайный Рококо золотая отводка 6/15 фарфор', 7490, 'test52', 6, 1, '2022-12-18 00:20:44'),
(56, 'Сервиз чайный Рококо Гуси 6/15 фарфор', 6990, 'test53', 6, 1, '2022-12-18 00:22:04'),
(57, 'Сервиз чайный Рококо Бледная роза отводка платиной 6/15 фарфор', 9870, 'test54', 6, 1, '2022-12-18 00:22:04'),
(58, 'Набор столовых приборов Аpollo lungo matt gold, сталь, 16 предметов', 4290, 'test55', 7, 1, '2022-12-18 00:23:19'),
(59, 'Набор ложек десертных Аtmosphere Silver, сталь, 2 шт.', 365, 'test56', 7, 1, '2022-12-18 00:23:19'),
(60, 'Набор столовых приборов Аpollo genio tahiti, сталь, 24 предмета', 3750, 'test57', 7, 1, '2022-12-18 00:24:30'),
(61, 'Набор столовых приборов Аpollo genio gala, сталь, 24 шт.', 4990, 'test58', 7, 1, '2022-12-18 00:24:30'),
(62, 'Tарелка Apollo Glaze blue 26,9 см обеденная фарфор', 689, 'test59', 8, 1, '2022-12-18 00:27:34'),
(63, 'Tарелка Apollo Glaze blue 21,7 см глубокая фарфор', 509, 'test60', 8, 1, '2022-12-18 00:27:34'),
(64, 'Tарелка Apollo Glaze blue 19,2 см десертная фарфор', 459, 'test61', 8, 1, '2022-12-18 00:28:35'),
(65, 'Tарелка Apollo Genio colibri 27 см обеденная фарфор', 729, 'test62', 8, 1, '2022-12-18 00:28:35'),
(66, 'Кружка Аpollo Sparkle, стекло, 200 мл', 225, 'test63', 9, 1, '2022-12-18 00:29:51'),
(67, 'Контейнер для бульона Phibo 0,5 л', 81, 'test64', 9, 1, '2022-12-18 00:29:51'),
(68, 'Кружка Walmer Vivien 350 мл', 511, 'test65', 9, 1, '2022-12-18 00:30:44'),
(69, 'Чашка с блюдцем Walmer Viscount 225 мл', 1499, 'test66', 9, 1, '2022-12-18 00:30:44'),
(70, 'тарелка', 120, 'test', 1, 1, NULL),
(71, 'test1', 500, 'test1.1', 1, 1, '2022-12-21 22:32:17'),
(72, 'test2', 150.62, 'test1.2', 1, 1, '2022-12-21 22:34:04'),
(73, 'test3', 150, 'test1.3', 3, 1, '2022-12-21 22:53:28'),
(74, 'test4', 200, 'test1.4', 8, 1, '2022-12-21 22:58:39'),
(75, '', 1000, '', 1, 1, '2022-12-21 23:11:16'),
(76, 'test5 ', 325, '', 1, 1, '2022-12-25 17:03:19'),
(77, 'test6', 120, '', 1, 1, '2022-12-25 17:04:39'),
(78, 'test6', 120, '', 1, 1, '2022-12-25 17:13:27'),
(79, 'test7', 1, '', 1, 1, '2022-12-25 17:13:58'),
(80, 'test8', 1000, '', 1, 1, '2022-12-25 17:16:35'),
(81, 'test9', 18, '', 1, 1, '2022-12-25 17:26:20'),
(82, 'test10', 150.62, '', 1, 1, '2022-12-25 17:29:16'),
(83, 'test11', 300, '', 1, 1, '2022-12-25 17:31:12'),
(84, 'test12', 500, '', 1, 1, '2022-12-25 17:31:39'),
(85, 'test13', 13, '', 1, 1, '2022-12-25 17:35:54'),
(86, 'test14', 985, 'test86', 1, 1, '2023-01-11 19:41:22'),
(87, 'test15', 985, 'test86', 1, 1, '2023-01-11 19:42:14'),
(88, 'test15', 985, 'test86', 1, 1, '2023-01-16 21:48:02'),
(89, 'test15', 985, 'test86', 1, 1, '2023-01-16 21:48:06'),
(91, 'test15', 985, 'test86', 1, 1, '2023-01-16 21:54:59'),
(92, 'test15', 985, 'test86', 1, 1, '2023-01-16 21:55:04'),
(93, 'Тарелка', 649, 'test4', 8, 1, NULL),
(94, 'Тарелка', 649, 'test4', 8, 1, NULL),
(95, 'Тарелка', 649, 'test4', 8, 1, NULL),
(96, 'кружка', 1001, 'test96', 9, 1, NULL),
(97, 'кружка', 0, NULL, 0, 1, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `password` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `active` int NOT NULL,
  `group` int NOT NULL,
  `email` text NOT NULL,
  `biography` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `password`, `active`, `group`, `email`, `biography`, `created_at`) VALUES
(1, 'test1', '$argon2i$v=19$m=65536,t=4,p=1$eVA1Y0ZFcVl0cGNuLkpkWg$0brN1oko205zQn1DgNpJA7DBjsBjH5lH/8kv520UZy4', 1, 1, 'test1@test1.ru', 'test1', '2023-01-31 20:23:29'),
(2, 'test2', '$argon2i$v=19$m=65536,t=4,p=1$ZVpFUEZKUEFZR2QzeDVTag$aQ/U9+d3QrcFSJ6Y9kD7g1zz+Kp03n29fsONtv7gMoQ', 1, 2, 'test2@test2.ru', 'test2', '2023-01-31 20:56:49'),
(3, 'test3', '$argon2i$v=19$m=65536,t=4,p=1$Z0xzYWlmdVouQnBMMERwdw$QfIC/q4t7MOADrOMGG3f+qqiXPfqiPHlO96wlOSpShs', 1, 3, 'test3@test3.ru', 'test3', '2023-01-31 20:57:38');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `product`
--
ALTER TABLE `product`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
